app/controllers/blog_controller.rb

	def update
		@post = Post.find(params[:postId])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def updateAction
		@id = params[:id]
		post = Post.find(@id)
		post.title = params[:title]
		post.description = params[:description]
		post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "123"], ["description", "123"], ["updated_at", "2022-06-23 21:02:16.531838"], ["id", 1]]